<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/ec035ee5-1dc4-4c22-b3fa-0a60ad1f1713/terraform-bin -chdir=terraform show -no-color /tmp/plan.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.backup_dns.aws_acm_certificate.domain_certificate will be created
  + resource "aws_acm_certificate" "domain_certificate" {
      + arn                       = (known after apply)
      + domain_name               = "staging.echo.walletconnect.org"
      + domain_validation_options = [
          + {
              + domain_name           = "staging.echo.walletconnect.org"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "staging.echo.walletconnect.org",
        ]
      + tags_all                  = {
          + "Application"      = "push"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "push"
          + "ProvisionedBy"    = "Terraform"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.backup_dns.aws_route53_record.cert_verification[0] will be created
  + resource "aws_route53_record" "cert_verification" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 300
      + type            = (known after apply)
      + zone_id         = "Z04141793HW2E4YP2FMPL"
    }

  # module.ecs.aws_route53_record.backup_dns_load_balancer will be created
  + resource "aws_route53_record" "backup_dns_load_balancer" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "staging.echo.walletconnect.org"
      + type            = "A"
      + zone_id         = "Z04141793HW2E4YP2FMPL"

      + alias {
          + evaluate_target_health = true
          + name                   = "staging-push-load-balancer-1585527513.eu-central-1.elb.amazonaws.com"
          + zone_id                = "Z215JYRZR1TBD5"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.backup_dns.aws_acm_certificate.domain_certificate will be created%0A  + resource "aws_acm_certificate" "domain_certificate" {%0A      + arn                       = (known after apply)%0A      + domain_name               = "staging.echo.walletconnect.org"%0A      + domain_validation_options = [%0A          + {%0A              + domain_name           = "staging.echo.walletconnect.org"%0A              + resource_record_name  = (known after apply)%0A              + resource_record_type  = (known after apply)%0A              + resource_record_value = (known after apply)%0A            },%0A        ]%0A      + id                        = (known after apply)%0A      + key_algorithm             = (known after apply)%0A      + not_after                 = (known after apply)%0A      + not_before                = (known after apply)%0A      + pending_renewal           = (known after apply)%0A      + renewal_eligibility       = (known after apply)%0A      + renewal_summary           = (known after apply)%0A      + status                    = (known after apply)%0A      + subject_alternative_names = [%0A          + "staging.echo.walletconnect.org",%0A        ]%0A      + tags_all                  = {%0A          + "Application"      = "push"%0A          + "Env"              = "staging"%0A          + "EnvironmentGroup" = "walletconnect"%0A          + "Name"             = "push"%0A          + "ProvisionedBy"    = "Terraform"%0A        }%0A      + type                      = (known after apply)%0A      + validation_emails         = (known after apply)%0A      + validation_method         = "DNS"%0A    }%0A%0A  # module.backup_dns.aws_route53_record.cert_verification[0] will be created%0A  + resource "aws_route53_record" "cert_verification" {%0A      + allow_overwrite = true%0A      + fqdn            = (known after apply)%0A      + id              = (known after apply)%0A      + name            = (known after apply)%0A      + records         = (known after apply)%0A      + ttl             = 300%0A      + type            = (known after apply)%0A      + zone_id         = "Z04141793HW2E4YP2FMPL"%0A    }%0A%0A  # module.ecs.aws_route53_record.backup_dns_load_balancer will be created%0A  + resource "aws_route53_record" "backup_dns_load_balancer" {%0A      + allow_overwrite = (known after apply)%0A      + fqdn            = (known after apply)%0A      + id              = (known after apply)%0A      + name            = "staging.echo.walletconnect.org"%0A      + type            = "A"%0A      + zone_id         = "Z04141793HW2E4YP2FMPL"%0A%0A      + alias {%0A          + evaluate_target_health = true%0A          + name                   = "staging-push-load-balancer-1585527513.eu-central-1.elb.amazonaws.com"%0A          + zone_id                = "Z215JYRZR1TBD5"%0A        }%0A    }%0A%0APlan: 3 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Action: `pull_request`*